Revit 2027 API
ViewDisplayBackground.Type Property
 The type of the background.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplayBackgroundType Type { get; }
Public ReadOnly Property Type As ViewDisplayBackgroundType
	Get
public:
property ViewDisplayBackgroundType Type {
	ViewDisplayBackgroundType get ();
}
member Type : ViewDisplayBackgroundType with get
Property Value
ViewDisplayBackgroundType
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace